<a href="https://colab.research.google.com/github/19pa1a0209/AI-lab/blob/master/Untitled.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#PANDAS Experiment-*2*

##1)Create a Dataframe manually

In [56]:
import pandas as pd
import numpy as np

In [57]:
df=pd.DataFrame({"Roll No":["EEE209","EEE227","EEE222"],"Name":["B.Sravani","G.Swathi","D.Jyothi"]})
df

  Roll No       Name
0  EEE209  B.Sravani
1  EEE227   G.Swathi
2  EEE222   D.Jyothi

##2)Import data into a Data Frame

In [58]:
df=pd.read_csv("/students_placement_data.csv")
df.head()

   Roll No Gender  ... registered_for_ Placement_Training  placement status
0        1      M  ...                                 NO        Not placed
1        2      F  ...                                yes            Placed
2        3      F  ...                                yes        Not placed
3        4      M  ...                                yes        Not placed
4        5      M  ...                                yes        Not placed

[5 rows x 9 columns]

3)Adding,Deleting,Modifying the rows/columns in a dataframe. 3.1) Adding a column

In [59]:
host_day=pd.read_csv("/hostlers_day_scholars.csv")
host_day.head()

  hostler/days scholar
0                    d
1                    d
2                    d
3                    d
4                    h

In [60]:
host_day.shape

(117, 1)

In [61]:
df["/hostlers_day_scholars.csv"]=host_day.values
df.head()

   Roll No Gender  ... placement status  /hostlers_day_scholars.csv
0        1      M  ...       Not placed                           d
1        2      F  ...           Placed                           d
2        3      F  ...       Not placed                           d
3        4      M  ...       Not placed                           d
4        5      M  ...       Not placed                           h

[5 rows x 10 columns]

In [62]:
del df["registered_for_ Placement_Training"]
df.head()

   Roll No Gender Section  ...  Backlogs  placement status  /hostlers_day_scholars.csv
0        1      M       A  ...        18        Not placed                           d
1        2      F       A  ...         0            Placed                           d
2        3      F       A  ...        13        Not placed                           d
3        4      M       A  ...        17        Not placed                           d
4        5      M       A  ...        17        Not placed                           h

[5 rows x 9 columns]

In [69]:
new_student=pd.DataFrame({"Roll No":[118],"Gender":["F"],"Section":["C"],"SSC Percentage":[98.4],"inter_Diploma_percentage":[99],"B.Tech_percentage":[75],"Backlogs":[0],"Hostler/Day_Scholar":["h"],"placement status":["Not placed"]},index=[117])
new_student

     Roll No Gender Section  ...  Backlogs  Hostler/Day_Scholar  placement status
117      118      F       C  ...         0                    h        Not placed

[1 rows x 9 columns]

In [77]:
df=df.append(new_student)
df.head()

   Roll No Gender  ... /hostlers_day_scholars.csv  Hostler/Day_Scholar
0        1      M  ...                          d                  NaN
1        2      F  ...                          d                  NaN
2        3      F  ...                          d                  NaN
3        4      M  ...                          d                  NaN
4        5      M  ...                          h                  NaN

[5 rows x 10 columns]

##3.4)Deleting a row

In [78]:
df.drop(3).head()

   Roll No Gender  ... /hostlers_day_scholars.csv  Hostler/Day_Scholar
0        1      M  ...                          d                  NaN
1        2      F  ...                          d                  NaN
2        3      F  ...                          d                  NaN
4        5      M  ...                          h                  NaN
5        6      M  ...                          h                  NaN

[5 rows x 10 columns]

##3.5)Modyfying Elements

In [79]:
df.loc[1,"Hostler/Day_Scholar"]="h"
df.head()

   Roll No Gender  ... /hostlers_day_scholars.csv  Hostler/Day_Scholar
0        1      M  ...                          d                  NaN
1        2      F  ...                          d                    h
2        3      F  ...                          d                  NaN
3        4      M  ...                          d                  NaN
4        5      M  ...                          h                  NaN

[5 rows x 10 columns]

##4)Applying functions on a data frame

In [84]:
def give_grace(x):
  if x<70:
    return(x+0.005)
  else:
    return(x)

In [86]:
df['B.Tech_percentage'].apply(give_grace)
df.head()

   Roll No Gender  ... /hostlers_day_scholars.csv  Hostler/Day_Scholar
0        1      M  ...                          d                  NaN
1        2      F  ...                          d                    h
2        3      F  ...                          d                  NaN
3        4      M  ...                          d                  NaN
4        5      M  ...                          h                  NaN

[5 rows x 10 columns]

##5)Iterations on DataFrame:

In [91]:
for index,rows in df[df["B.Tech_percentage"]>=80].iterrows():
  print(rows["Roll No"],"-",rows["B.Tech_percentage"])

18 - 85.39
60 - 81.1
71 - 80.47
97 - 88.1
102 - 83.38

##6)Accessing the elements from a data frame

In [92]:
df.loc[[1,2],["SSC Percentage","inter_Diploma_percentage"]]

   SSC Percentage  inter_Diploma_percentage
1            89.0                      92.4
2            67.0                      68.0

##7)Different ways to deal with NA's in dataframe

In [99]:
df["SSC Percentage"] = df["SSC Percentage"].replace(to_replace=np.nan,value=np.mean(df["SSC Percentage"]))
df.head()

   Roll No Gender  ... /hostlers_day_scholars.csv  Hostler/Day_Scholar
0        1      M  ...                          d                  NaN
1        2      F  ...                          d                    h
2        3      F  ...                          d                  NaN
3        4      M  ...                          d                  NaN
4        5      M  ...                          h                  NaN

[5 rows x 10 columns]

##8)Group by operations on dataframe

In [100]:
a=df.groupby("Gender")
a["B.Tech_percentage"].agg(np.mean)

Gender
F    71.732807
M    56.994265
Name: B.Tech_percentage, dtype: float64

##9)Merging the DataFrames

In [107]:
b=pd.read_csv("/urban_rural (1).csv")
b.head()

   Roll No Urban/Rural
0        1       Urban
1        2       Rural
2        6       Rural
3        7       Urban
4        8       Urban

In [108]:
b.shape

(117, 2)

In [112]:
df=pd.merge(df,b,on="Roll No")
df.head()

   Roll No Gender  ... Hostler/Day_Scholar  Urban/Rural
0        1      M  ...                 NaN        Urban
1        2      F  ...                   h        Rural
2        3      F  ...                 NaN        Urban
3        4      M  ...                 NaN        Urban
4        5      M  ...                 NaN        Urban

[5 rows x 11 columns]